wanlinqiang/stc8g-traffic-light/include/stc8g.sdcc.h
#define PWM46CR (*(unsigned char volatile __xdata *)0xFC94)
#define PWM46HLD (*(unsigned char volatile __xdata *)0xFC95)
#define PWM47T1H (*(unsigned char volatile __xdata *)0xFC98)
#define PWM47T1L (*(unsigned char volatile __xdata *)0xFC99)
#define PWM47T2H (*(unsigned char volatile __xdata *)0xFC9A)
#define PWM47T2L (*(unsigned char volatile __xdata *)0xFC9B)
#define PWM47CR (*(unsigned char volatile __xdata *)0xFC9C)
#define PWM47HLD (*(unsigned char volatile __xdata *)0xFC9D)
#define PWM5CH (*(unsigned char volatile __xdata *)0xFCA0)
#define PWM5CL (*(unsigned char volatile __xdata *)0xFCA1)
#define PWM5CKS (*(unsigned char volatile __xdata *)0xFCA2)
#define PWM5IF (*(unsigned char volatile __xdata *)0xFCA5)
#define PWM5FDCR (*(unsigned char volatile __xdata *)0xFCA6)
#define PWM50T1H (*(unsigned char volatile __xdata *)0xFCB0)
#define PWM50T1L (*(unsigned char volatile __xdata *)0xFCB1)
#define PWM50T2H (*(unsigned char volatile __xdata *)0xFCB2)
#define PWM50T2L (*(unsigned char volatile __xdata *)0xFCB3)
#define PWM50CR (*(unsigned char volatile __xdata *)0xFCB4)
#define PWM50HLD (*(unsigned char volatile __xdata *)0xFCB5)
#define PWM51T1H (*(unsigned char volatile __xdata *)0xFCB8)
#define PWM51T1L (*(unsigned char volatile __xdata *)0xFCB9)
#define PWM51T2H (*(unsigned char volatile __xdata *)0xFCBA)
#define PWM51T2L (*(unsigned char volatile __xdata *)0xFCBB)
#define PWM51CR (*(unsigned char volatile __xdata *)0xFCBC)
#define PWM51HLD (*(unsigned char volatile __xdata *)0xFCBD)
#define PWM52T1H (*(unsigned char volatile __xdata *)0xFCC0)
#define PWM52T1L (*(unsigned char volatile __xdata *)0xFCC1)
#define PWM52T2H (*(unsigned char volatile __xdata *)0xFCC2)
#define PWM52T2L (*(unsigned char volatile __xdata *)0xFCC3)
#define PWM52CR (*(unsigned char volatile __xdata *)0xFCC4)
#define PWM52HLD (*(unsigned char volatile __xdata *)0xFCC5)
#define PWM53T1H (*(unsigned char volatile __xdata *)0xFCC8)
#define PWM53T1L (*(unsigned char volatile __xdata *)0xFCC9)
#define PWM53T2H (*(unsigned char volatile __xdata *)0xFCCA)
#define PWM53T2L (*(unsigned char volatile __xdata *)0xFCCB)
#define PWM53CR (*(unsigned char volatile __xdata *)0xFCCC)
#define PWM53HLD (*(unsigned char volatile __xdata *)0xFCCD)
#define PWM54T1H (*(unsigned char volatile __xdata *)0xFCD0)
#define PWM54T1L (*(unsigned char volatile __xdata *)0xFCD1)
#define PWM54T2H (*(unsigned char volatile __xdata *)0xFCD2)
#define PWM54T2L (*(unsigned char volatile __xdata *)0xFCD3)
#define PWM54CR (*(unsigned char volatile __xdata *)0xFCD4)
#define PWM54HLD (*(unsigned char volatile __xdata *)0xFCD5)
#define PWM55T1H (*(unsigned char volatile __xdata *)0xFCD8)
#define PWM55T1L (*(unsigned char volatile __xdata *)0xFCD9)
#define PWM55T2H (*(unsigned char volatile __xdata *)0xFCDA)
#define PWM55T2L (*(unsigned char volatile __xdata *)0xFCDB)
#define PWM55CR (*(unsigned char volatile __xdata *)0xFCDC)
#define PWM55HLD (*(unsigned char volatile __xdata *)0xFCDD)
#define PWM56T1H (*(unsigned char volatile __xdata *)0xFCE0)
#define PWM56T1L (*(unsigned char volatile __xdata *)0xFCE1)
#define PWM56T2H (*(unsigned char volatile __xdata *)0xFCE2)
#define PWM56T2L (*(unsigned char volatile __xdata *)0xFCE3)
#define PWM56CR (*(unsigned char volatile __xdata *)0xFCE4)
#define PWM56HLD (*(unsigned char volatile __xdata *)0xFCE5)
#define PWM57T1H (*(unsigned char volatile __xdata *)0xFCE8)
#define PWM57T1L (*(unsigned char volatile __xdata *)0xFCE9)
#define PWM57T2H (*(unsigned char volatile __xdata *)0xFCEA)
#define PWM57T2L (*(unsigned char volatile __xdata *)0xFCEB)
#define PWM57CR (*(unsigned char volatile __xdata *)0xFCEC)
#define PWM57HLD (*(unsigned char volatile __xdata *)0xFCED)
///////////////////////////////////////////////// 
#endif
